Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_Framework_Swift/Framework_Swift-level1_source3.tmx
Source language: en_us
Languages: ja

source: In the following example, the product of 10 and 50 is greater than the maximum representable Int8 value, so the result is the partial value after discarding the overflowing bits.
ja: 以下の例において、10と50の積は、最大限表現可能なInt8値より大きいです、それで結果はオーバーフローするビットを廃棄後の部分的な値です。

source: In the following example, the result of 21 * 21 is greater than the maximum representable Int8 value:
ja: 以下の例において、21 * 21の結果は、最大限表現可能なInt8値より大きいです：

source: In the following example, the result of 21 + 120 is greater than the maximum representable Int8 value:
ja: 以下の例において、21 + 120の結果は、最大限表現可能なInt8値より大きいです：

source: In the following example, the result of 21 - 50 is less than zero, the minimum representable UInt8 value:
ja: 以下の例において、21 - 50の結果は、最大限表現可能なUInt8値より大きいです：

source: In the following example, the sum of 100 and 121 is greater than the maximum representable Int8 value, so the result is the partial value after discarding the overflowing bits.
ja: 以下の例において、100と121の合計は、最大限表現可能なInt8値より大きいです、それで結果はオーバーフローするビットを廃棄後の部分的な値です。

source: In this case, see the documentation of Collection.underestimatedCount.
ja: この場合には、Collection.underestimatedCountの文書を見てください。

source: In this case, the numberOfCookies constant has the default type for an integer literal, Int, as designated by the IntegerLiteralType type alias.
ja: この場合では、numberOfCookies定数は整数リテラルに対する省略時型、Intを持ちます、IntegerLiteralType型エイリアスによって設計されるように。

source: In this example, 100 bytes of raw memory are allocated for the pointer bytesPointer, and then the first four bytes are bound to the Int8 type.
ja: この例では、100バイトの生のメモリがポインタbytesPointerに対して割り当てられて、それから最初の４バイトがInt8型に束縛されます。

source: In this example, filter(_:) is used to include only names shorter than five characters.
ja: この例において、filter(_:)は５つの文字より短い名前のみ含めるために使われます。

source: In this example, map is used first to convert the names in the array to lowercase strings and then to count their characters.
ja: この例では、mapは最初に配列中の名前を小文字文字列に変換するために、それからそれらの文字を数えるために使われます。

source: In this example, x is initialized as an Int8 instance by clamping 500 to the range -128...127, and y is initialized as a UInt instance by clamping -500 to the range 0...UInt.max.
ja: この例において、xはInt8インスタンスとして、500を範囲-128...127に制限すること（クランピング）によって初期化されます、そしてyはUIntインスタンスとして、-500を範囲0...UInt.maxに制限することによって初期化されます。

source: In this example, an array of three ranges is flattened so that the elements of each range can be iterated in turn.
ja: この例において、３つの範囲からなる配列は平坦化されます、それで各範囲の要素は順に反復されることができます。

source: In this example, an asynchronous sequence called Counter produces Int values from 1 to 10.
ja: この例において、Counterと呼ばれる非同期シーケンスはInt値を1から10まで生み出します。

source: In this example, an asynchronous sequence called Counter produces Int values from 1 to 4.
ja: この例において、Counterと呼ばれる非同期シーケンスはInt値を1から4まで生み出します。

source: In this example, an asynchronous sequence called Counter produces Int values from 1 to 5.
ja: この例において、Counterと呼ばれる非同期シーケンスは、Int値を1から5まで生み出します。

source: In this example, note the difference in the result of using map and compactMap with a transformation that returns an optional Int value.
ja: この例において、mapとcompactMapを、オプショナルInt値を返す変換とともに使う結果の違いに注意してください。

source: In this example, note the difference in the result of using map and flatMap with a transformation that returns an array.
ja: この例において、mapとflatMapをある配列を返す変換とともに使うことの結果における違いに注意してください。

source: In this example, note the difference in the result of using map and flatMap with a transformation that returns an optional Int value.
ja: この例において、mapとflatMapを、オプショナルInt値を返す変換とともに使う結果の違いに注意してください。

source: In this example, the CFArrayCallBacks initializer uses nil values as arguments for the retain and release parameters, the customCopyDescription(_:) function as the argument for the customCopyDescription parameter, and a closure literal as the argument for the equal parameter.
ja: この例において、CFArrayCallBacksイニシャライザはnil値をretainとreleaseパラメーターに対する引数として、customCopyDescription(_:)関数をcustomCopyDescriptionパラメーターに対する引数として、そしてクロージャリテラルをequalパラメーターに対する引数として使います。

source: In this example, the assignment to the letterK constant is handled by this initializer behind the scenes.
ja: この例において、letterK定数への代入は、このイニシャライザによって舞台裏で取り扱われます。

source: In this example, the assignment to the x constant calls this integer literal initializer behind the scenes.
ja: この例において、x定数への代入は、この整数リテラルイニシャライザを舞台裏で呼びます。

source: In this example, the expression singleDigits.dropFirst(5)) is equivalent to calling this initializer with singleDigits and a range covering the last five items of singleDigits.indices.
ja: この例において、式singleDigits.dropFirst(5))は、このイニシャライザをsingleDigitsおよびsingleDigits.indicesの終わり５項目を対象とする範囲とともに呼び出すことに等しいです。

source: In this example, three elements in the middle of an array of integers are replaced by the five elements of a Repeated<Int> instance.
ja: この例では、整数からなる配列の真ん中の３つの要素が、Repeated<Int>インスタンスの５つの要素によって置き換えられます。

source: Indentation is stripped from each line of a multiline string literal to match the indentation of the closing delimiter.
ja: 字下げは、複数行文字列リテラルの各行から剥ぎ取られて、閉じ区切り子の字下げに合わせられます。

source: Index and iterator types for other sequence and collection types in the standard library.
ja: 標準ライブラリの中の他のシーケンスとコレクション型のためのインデックスとイテレータ型

source: Indicates that a precondition was violated.
ja: これは前提条件が破られたことを指し示します。

source: Indicates that an internal sanity check failed.
ja: これはある内部的な正常性確認が失敗したことを指し示します。

source: Indices and Iterators
ja: インデックスとイテレータ

source: Indices of a slice can be used interchangeably with indices of the base collection.
ja: あるスライスのインデックスは、基盤コレクションのインデックスと交換可能に使われることができます。

source: Individual Unicode Scalar Values
ja: 個々のユニコードスカラー値

source: Inequality is the inverse of equality.
ja: 不等性は、同等性の裏返しです。

source: Infrequently Used Functionality
ja: 滅多に使われない機能性

source: Inherited By
ja: 継承される先

source: Inherits From
ja: 継承元

source: Initialization with Literals
ja: リテラルを使った初期化

source: Initialization, assignment, and deinitialization can be performed using UnsafeMutablePointer methods.
ja: 初期化、代入、そしてデイニシャライズは、UnsafeMutablePointerメソッドを使って実行されます。

source: Initialized Memory
ja: 初期化済みメモリ

source: Initializers
ja: イニシャライザ

source: Initializes every element in this buffer’s memory to a copy of the given value.
ja: このバッファのもつメモリの中の全ての要素を与えられた値のコピーへと初期化します。

source: Initializes the buffer’s memory with the given elements, binding the initialized memory to the elements’ type.
ja: バッファのもつメモリを与えられた要素で初期化します、初期化されたメモリを要素のもつ型に束縛します。

source: Initializes the buffer’s memory with the given elements.
ja: 与えられたいくらかの要素を使ってバッファの持つメモリを初期化します。

source: Initializes the memory referenced by this buffer with the given value, binds the memory to the value’s type, and returns a typed buffer of the initialized memory.
ja: このバッファによって参照されるメモリを与えられた値で初期化して、そのメモリを値の型に束縛し、そして初期化されたメモリの型付バッファを返します。

source: Initializes the memory referenced by this pointer with the given value, binds the memory to the value’s type, and returns a typed pointer to the initialized memory.
ja: このポインタによって参照されるメモリを与えられた値で初期化して、そのメモリを値の型に束縛し、そして初期化されたメモリへの型付ポインタを返します。

source: Initializes the memory referenced by this pointer with the values starting at the given pointer, binds the memory to the values’ type, and returns a typed pointer to the initialized memory.
ja: このポインタによって参照されるメモリを与えられたポインタで始まる値で初期化して、そのメモリを値の型に束縛し、そして初期化されたメモリへの型付ポインタを返します。

source: Initializes the memory referenced by this pointer with the values starting at the given pointer, binds the memory to the values’ type, deinitializes the source memory, and returns a typed pointer to the newly initialized memory.
ja: このポインタによって参照されるメモリを与えられたポインタで始まる値で初期化して、そのメモリを値の型に束縛し、元となるメモリをデイニシャライズして、そして新しく初期化されたメモリへの型付ポインタを返します。

source: Initializes the memory referenced by this pointer with the values starting at the given pointer.
ja: このポインタによって参照されるメモリを、与えられたポインタで始まるいくらかの値で初期化します。

source: Initializes this pointer’s memory with a single instance of the given value.
ja: このポインタのもつメモリを、与えられた値の単一のインスタンスで初期化します。

source: Initializes this pointer’s memory with the specified number of consecutive copies of the given value.
ja: このポインタのもつメモリを、指定された数の与えられた値の連続コピーで初期化します。

source: Input and Output
ja: 入力と出力

source: Inserting Characters
ja: 文字の挿入

source: Inserts a collection of characters at the specified position.
ja: 文字列からなるコレクションを指定された位置で挿入します。

source: Inserts a new character at the specified position.
ja: 新しい文字を指定された位置で挿入します。

source: Inserts a new element into the collection at the specified position.
ja: ある新しい要素をコレクションへ指定された位置で挿入します。

source: Inserts the elements of a sequence into the collection at the specified position.
ja: あるシーケンスに属する複数の要素をコレクションへ指定された位置で挿入します。

source: Inspecting a Scalar
ja: スカラーを調査する

source: Inspecting a String
ja: 文字列を調査する

source: Instance Casting
ja: インスタンスのキャスト

source: Instance Method
ja: インスタンスメソッド

source: Instance Methods
ja: インスタンスメソッド

source: Instance Properties
ja: 様々なインスタンスプロパティ

source: Instance Property
ja: インスタンスプロパティ

source: Instances of UnfoldSequence are created with the functions sequence(first:next:) and sequence(state:next:).
ja: UnfoldSequenceのインスタンスは、関数sequence(first:next:)およびsequence(state:next:)で作成されます。

source: Instances of the StaticString type are immutable.
ja: StaticString型のインスタンスは、不変です。

source: Instances of types that conform to the TextOutputStreamable protocol can write their value to instances of any type that conforms to the TextOutputStream protocol.
ja: TextOutputStreamableプロトコルに準拠する型のインスタンスは、それらの値をTextOutputStreamプロトコルに準拠するあらゆる型のインスタンスへ書き出すことができます。

source: Instantiates an instance of the conforming type from a string representation.
ja: 準拠する型のインスタンスを文字列表現から初期化します。

source: Instead of only accessing the specific UTF-8 code unit, that index is treated as the position of the character at the index’s encoded offset.
ja: 特定のUTF-8コード単位にアクセスすることだけではなく、そのインデックスは、インデックスの持つエンコードされたオフセットでの文字の位置として扱われます。

source: Instead, convert an instance of any type to a string by using the String(describing:) initializer.
ja: 代わりに、どんな型のインスタンスでも文字列へと、String(describing:)イニシャライザを使って変換してください。

source: Instead, convert an instance of any type to a string by using the String(reflecting:) initializer.
ja: 代わりに、どんな型のインスタンスでも文字列へと、String(reflecting:)イニシャライザを使って変換してください。

source: Instead, corresponding next call to TaskGroup.next() rethrows that error.
ja: 代わりに、TaskGroup.next()への対応する次の呼び出しはそのエラーを再スローします。

source: Instead, create a slice of a collection by using the collection’s range-based subscript or by using methods that return a subsequence.
ja: 代わりに、そのコレクションのもつ範囲に基づく添え字によって、または下位シーケンスを返すメソッドを使うことによって、コレクションのスライスを作成してください。

source: Instead, define your own subsequence type that takes your index invalidation requirements into account.
ja: その代わりに、あなたのインデックス無効化要件を考慮に入れるあなた自身の下位シーケンス型を定義してください。

source: Instead, initialize a variable or constant using a string literal with interpolated expressions.
ja: 代わりに、補間式いくらかを持つある文字列リテラルを使って変数や定数を初期化してください。

source: Instead, initialize a variable or constant using an integer literal.
ja: 代わりに、整数リテラルを使って変数や定数を初期化してください。

source: Instead, the corresponding next() call will throw the error when necessary.
ja: 代わりに、対応するnext()呼び出しがエラーを必要な時にスローするでしょう。

source: Instead, the corresponding call to TaskGroup.next() rethrows that error.
ja: 代わりに、TaskGroup.next()への対応する呼び出しはそのエラーを再スローします。

source: Instead, use an initializing method, such as initialize(to:count:).
ja: 代わりに、初期化するメソッド、initialize(to:count:)などを使ってください。

source: Instead, use simple assignment to create a new constant or variable equal to this string.
ja: 代わりに、単純な代入を使ってこの文字列と等しい新しい定数または変数を作成してください。

source: Instead, use string interpolation to create a new string by including values, literals, variables, or expressions enclosed in parentheses, prefixed by a backslash (\(…)).
ja: 代わりに、文字列補間を使って、バックスラッシュ\(…)を前に置いた丸括弧に囲まれた値、リテラル、変数、または式を含めることで、新しい文字列を作成してください。

source: Instead, use the task property of UnsafeCurrentTask to access an instance of Task that you can store long-term and interact with outside of the closure body.
ja: そうしないで、UnsafeCurrentTaskのtaskプロパティを使うことでアクセスを、あなたが長期間格納してそしてクロージャ本体の外側で相互作用できるTaskのインスタンスにおこなってください。

source: Instead, use the body closure’s buffer argument to access the values in memory as instances of type T.
ja: 代わりに、bodyクロージャの持つバッファ引数を使ってメモリ中の値に型Tのインスタンスとしてアクセスしてください。

source: Instead, use the body closure’s pointer argument to access the values in memory as instances of type T.
ja: 代わりに、bodyクロージャのもつポインタ引数を使うことで、メモリの中の値に型Tのインスタンスとしてアクセスしてください。

source: Instead, you must know the type of value previously in memory and initialize or assign the memory.
ja: 代わりに、あなたは前もってメモリ中の値の型を知っていて、メモリを初期化またはアサインする必要があります。

source: Integer
ja: 整数

source: Integer Value Casting
ja: 整数値のキャスト

source: Interpolated expressions don’t pass through this method; instead, Swift selects an overload of appendInterpolation.
ja: 補間式はこのメソッドを通り抜けられません；代わりに、SwiftはappendInterpolationのオーバーロードを選択します。

source: Invokes the given closure with a C va_list argument derived from the given array of arguments.
ja: 与えられたクロージャを、その与えられた引数の配列から引き出されたC va_list引数で発動します。

source: Invokes the given closure with a buffer containing the static string’s UTF-8 code unit sequence (excluding the null terminator).
ja: 与えられたクロージャを発動します、静的文字列のもつUTF-8コード単位シーケンス（null終端子を除外して）を含んでいるパッファを用います。

source: Invokes the given closure with a buffer pointer covering the raw bytes of the given argument.
ja: 与えられたクロージャを、与えられた引数の生のバイトを変換しているバッファポインタとともに発動します。

source: Invokes the given closure with a mutable buffer pointer covering the raw bytes of the given argument.
ja: 与えられたクロージャを、与えられた引数の生のバイトを変換している可変バッファポインタとともに発動します。

source: Invokes the given closure with a pointer to the given argument.
ja: 与えられたクロージャを、与えられた引数に対するポインタとともに発動します。

source: It also supports chaining through optional values within a chain, such as #keyPath(Person.bestFriend.name).
ja: それはまた、連鎖内でオプショナル値を通した連鎖をサポートします、例えば#keyPath(Person.bestFriend.name)など。

source: It does not attempt to cover multiple uses of some scalars, such as the use of letters to represent Roman numerals.
ja: それは、いくつかのスカラーの複数の使用を対象とすること、たとえばローマ数字を表すための複数の表音文字の使用など、を試みようとしません。

source: It does not copy the elements from the collection into separate storage.
ja: それは、要素をそのコレクションから別個のストレージへとコピーしません。

source: It is an unowned reference to avoid unnecessary reference-counting work even when working with actors abstractly.
ja: これはある非所有参照で、不必要な参照カウント作業を、アクターそれらを抽象的に扱っている時でさえ防ぐためのものです。

source: It is guaranteed to be empty when returning from that body because a task group waits for all child tasks to complete before returning.
ja: その本体から返る時に空であることは保証されます、なぜならタスクグループは全ての子タスクが完了するのを復帰する前に待つからです。

source: It is implicitly carried with the task, and is accessible by any child tasks the task creates (such as TaskGroup or async let created tasks).
ja: それは暗黙的にそのタスクとともに運搬されます、そしてそのタスクが作成するあらゆる子タスクによってアクセス可能です（たとえば TaskGroup または async let が作成したタスク）。

source: It is possible to define not-optional task-local values, and an explicit default value must then be defined instead.
ja: 非オプショナルのタスクローカル値を定義するのは可能です、そしてある明示的な省略時の値がそのとき代わりに定義されなければなりません。

source: It is possible to perform task-local value reads from either asynchronous or synchronous functions.
ja: タスクローカル値の読み出しを非同期または同期関数のどちらかから実行することは可能です。

source: It is unusual to need to call this method directly.
ja: このメソッドを直接呼び出す必要は通常ありません。

source: It is used by the compiler when you create a string using string interpolation.
ja: それはあなたが文字列補間を使って文字列を作成する時にコンパイラによって使われます。

source: It is used by the compiler when you initialize a string using a string literal.
ja: それは、あなたが文字列リテラルを使って文字列を初期化する時にコンパイラによって使われます。

source: It may be used by the compiler when you initialize a static string using a string literal.
ja: それは、あなたが文字列リテラルを使って静的文字列を初期化する時にコンパイラによって使われるでしょう。

source: It may be used by the compiler when you initialize a static string using an extended grapheme cluster.
ja: それは、あなたが拡張初期素クラスタを使って静的文字列を初期化する時にコンパイラによって使われるでしょう。

source: It may be used by the compiler when you initialize a static string with a Unicode scalar.
ja: それは、あなたがユニコードスカラーで静的文字列を初期化する時にコンパイラによって使われるでしょう。

source: It may be used by the compiler when you use a string literal to initialize a Unicode.Scalar instance.
ja: それは、あなたが文字列リテラルを使ってUnicode.Scalarインスタンスを初期化する時にコンパイラによって使われます。

source: It replaces the completion handlers with async functions, and uses actors to guarantee safe access to data.
ja: それは、完了ハンドラをasync関数で置き換えます、そしてアクターを使ってデータへの安全なアクセスを保証します。

source: It will, however, continue to create tasks when the plain async function is used.
ja: それは、しかしながら、単純なasync関数が使われる場合はタスクの作成を続けます。

source: Iterating over a String's Characters
ja: 文字列の持つ文字のすべてにわたって反復する

source: It’s also possible to use for await to collect results of a task groups:
ja: for awaitを使ってタスクグループの結果を収集することも可能です：

source: It’s guaranteed to be empty when returning from that body because a task group waits for all child tasks to complete before returning.
ja: その本体から返る時に空であることは保証されます、なぜならタスクグループは全ての子タスクが完了するのを復帰する前に待つからです。

source: Joint Iteration
ja: 接合反復

source: Key Paths
ja: キーパス

source: Key paths created using the #keyPath string expression don’t pass type information about the properties or methods they reference to the APIs that accept key paths.
ja: #keyPath文字列式を使って作成されるキーパスは、それらが参照するプロパティまたはメソッドについての型情報を、キーパスを受け入れるAPIに渡しません。

source: Key-Path Expressions
ja: キーパス式

source: Keys and key paths are frequently used for key-value coding (KVC), a mechanism for indirectly accessing an object’s attributes and relationships using string identifiers.
ja: キーとキーパスは、文字列識別子を使ってオブジェクトの属性および関連付け（リレーションシップ）に間接的にアクセスするための仕組み、キー値コーディング（KVC）のためにしばしば使われます。

source: Language Interoperability
ja: 言語互換性

source: Lazy Collections
ja: 遅延コレクション

source: Lazy Wrappers
ja: 遅延ラッパー

source: Learn how functions and methods that take a completion handler are converted to Swift asynchronous functions.
ja: 完了ハンドラをとる関数およびメソッドがどのようにSwift非同期関数へと変換されるかを学んでください。

source: Learn how the Swift standard library uses protocols and generics to express powerful constraints.
ja: どのようにSwift標準ライブラリがプロトコルや総称体を使ってパワフルな制約を表すかを学んでください。

source: Learn the recommended steps to migrate your code.
ja: あなたのコードを移行するための推奨される段階を学んでください。

source: Left bit shift and assign
ja: 左ビットシフトして代入する

source: Left bit shift ignoring overflow and assign
ja: 左ビットシフト、オーバーフローを無視します、そして割り当てます

source: Less than
ja: より小さい

source: Less than or equal
ja: より小さいか、等しい

source: Like Task.detached, this initializer creates a separate, top-level task.
ja: Task.detachedと同様に、このイニシャライザはある分離した、トップレベルタスクを作成します。

source: Like Task.detached, the async function creates a separate, top-level task.
ja: Task.detachedと同様に、async関数はある分離した、トップレベルタスクを作成します。

source: Like a C function pointer, a Swift function type with the @convention(c) attribute does not capture the context of its surrounding scope.
ja: C関数ポインタのように、@convention(c)属性を持つスウィフト関数型は、それを取り囲んでいるスコープのコンテキストをキャプチャしません。

source: Likewise, if distance < 0, a limit that is greater than i has no effect.
ja: 同様に、distance < 0ならば、iより大きい限度は効果を持ちません。

source: Likewise, if n < 0, a limit that is greater than i has no effect.
ja: 同様に、n < 0ならば、iより大きい限度は効果を持ちません。

source: Likewise, if distance < 0, limit should be less than i to have any effect.
ja: 同様に、distance < 0ならば、limitが何らかの効果を持つにはiより少なくなければなりません。

source: Likewise, if you pass a zero-length collection as the newElements parameter, this method removes the elements in the given subrange without replacement.
ja: 同様に、あなたがゼロ長コレクションをnewElementsパラメータとして渡すならば、このメソッドは与えられた下位範囲の中の要素を置き換えることなく削除します。

source: Likewise, it’s the responsibility of the code running as part of the task to check for cancellation whenever stopping is appropriate.
ja: 同じように、停止が適切である時はいつでも取り消しを確認するのは、タスクの一部として動作しているコードの責任です。

source: Likewise, scalars that default to text presentation can be followed by U+FE0F VARIATION SELECTOR-16 to request the emoji presentation.
ja: 同じように、テキスト表現が初期状態のスカラーは、U+FE0F VARIATION SELECTOR-16が後に続くことで、emoji表現を要請できます。

source: Linux platforms use getrandom(2) when available; otherwise, they read from /dev/urandom.
ja: Linuxプラットホームは、getrandom(2)を利用可能な場合は使います；そうでなければ、それらは/dev/urandomから読み出します。

source: Loading returns an array of drinks, and saving takes an array of drinks as an argument.
ja: ロードでは、ドリンクそれらからなるある配列を返します、そしてセーブ（保存）ではドリンクそれらからなるある配列を引数としてとります。

source: Logical AND
ja: 論理積

source: Logical NOT
ja: 論理否定

source: Logical OR
ja: 論理和

source: Logical Values
ja: 論理値

source: Long-term storage of a slice may therefore prolong the lifetime of elements that are no longer otherwise accessible, which can erroneously appear to be memory leakage.
ja: あるスライスの長期ストレージは、もはやそれ以外ではアクセス可能ではない要素の寿命を延長し、それはメモリの漏洩であるように見ることができます。

source: Make sure the Coffee Tracker complication appears on the active watch face.
ja: Coffee Trackerコンプリケーションがアクティブなウォッチフェイス上に現れることを確かめてください。

source: Make your data types encodable and decodable for compatibility with external representations such as JSON.
ja: あなたのデータ型のエンコーディングとデコーディングを外部表現、例えばJSONなどとの互換性のために行います。

source: Managed Buffers
ja: バッファ管理

source: Manipulating Indices
ja: インデックスを操る

source: Manual Iteration
ja: 手動反復

source: Manual Memory Management
ja: 手動メモリ管理

source: Many collection operations are performed by wrapping a collection in another type, instead of copying the collection's contents.
ja: 多くのコレクション演算は、コレクションを別の型の中にラップすることによって実行されます、コレクションの内容をコピーするのではなく。

source: Many individual characters, such as “é”, “김”, and “🇮🇳”, can be made up of multiple Unicode scalar values.
ja: 多くの単一の文字、例えば「é」、「김」、そして「🇮🇳」などが、複数のユニコードスカラー値から構成されます。

source: Many pointer operations must only be applied to pointers with memory in a specific state—you must keep track of the state of the memory you are working with and understand the changes to that state that different operations perform.
ja: 多くのポインタ演算はある特定の状態のメモリを持つポインタに適用されるだけであるべきです — あなたは、あなたが作業しているメモリの状態を見失わないようにして、異なる演算が実行するその状態の変更を理解していなければなりません。

source: Many tasks will check for cancellation before beginning their “actual work”, however this is not a requirement nor is it guaranteed how and when tasks check for cancellation in general.
ja: 多くのタスクは、取り消しについて確認をそれらの “実際の仕事” を始める前に行うでしょう、しかしながらこれは要件ではありませんしまたどのようにそしていつタスクそれらが取り消しについて確認するかも一般的に保証されません。

source: Marks attached at the bottom left.
ja: 左下で付けられる記号。

source: Marks attached at the top right.
ja: 右上で付けられる記号。

source: Marks attached directly above.
ja: 直上に付けられる記号。

source: Marks attached directly below.
ja: 直下に付けられる記号。

source: Marks that overlay a base letter or symbol.
ja: 基底表音文字またはシンボルを覆う記号。

source: Measuring the Length of a String
ja: 文字列の長さを計測する

source: Memory Access
ja: メモリアクセス

source: Memory Layout
ja: メモリレイアウト

source: Memory can be untyped and uninitialized, bound to a type and uninitialized, or bound to a type and initialized to a value.
ja: メモリは、型無しで未初期化、ある型に束縛されて未初期化、またはある型に束縛されてある値に初期化される可能性があります。

source: Memory that has been bound to a type can be rebound to a different type only after it has been deinitialized or if the bound type is a trivial type.
ja: ある型に束縛されているメモリは、それがデイニシャライズされた後にまたは束縛型がtrivial typeである場合にのみ、異なる型に再束縛が可能です。

source: Memory that has been bound to a type, whether it is initialized or uninitialized, is typically accessed using typed pointers—instances of UnsafePointer and UnsafeMutablePointer.
ja: ある型に束縛されているメモリは、それが初期化済みか未初期化かにかかわらず、一般的に型付ポインタを使ってアクセスされます — UnsafePointerおよびUnsafeMutablePointerではなくて。

source: Memory that has just been allocated through a typed pointer or has been deinitialized is in an uninitialized state.
ja: 型付ポインタを通して今しがたアロケートされる、または未初期化状態にデイニシャライズされるメモリ。

source: Memory that you manually manage can be either untyped or bound to a specific type.
ja: あなたが手動で管理するメモリは、特定の型に対して型付けされないまたは束縛されるのいずれかが可能です。

source: Migrating Your Objective-C Code to Swift
ja: あなたのObjective-Cコードのスウィフトへの移行

source: Model data with numbers, Boolean values, and other fundamental types.
ja: 数、ブール値、および他の基本的な型に関してデータをモデル化します。
